webtemplates/CC.ORBITAL.CAPTURE.XML

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MarkForCapture xmlns="urn:ws.paymentech.net/PaymentechGateway"><markForCaptureRequest xsi:type="IFXPmtAuthModRqOrbitalMarkForCaptureAdapter"><amount>[CC.AMOUNT]</amount><bin>[CC.BIN]</bin><merchantID>[CC.LOGIN]</merchantID><terminalID>[TERM.ID]</terminalID><txRefNum>[CC.REF.NUM]</txRefNum><retryTrace>[CC.TRACEVALUE]</retryTrace><pCard3LineItems xsi:nil="true" /></markForCaptureRequest></MarkForCapture></soap:Body></soap:Envelope>
